{
  "_name_or_path": "/inspire/hdd/global_user/wangyixuan-240108120106/1.4b_addhidden_vary234/checkpoint-150000/",
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "auto_map": {
    "AutoModelForCausalLM": "modeling_gpt_neox.GPTNeoXForCausalLM"
  },
  "attention_bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "classifier_dropout": 0,
  "eos_token_id": 0,
  "num_jacobi_iterations": 4,
  "hidden_act": "gelu",
  "hidden_dropout": 0.0,
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox",
  "num_latent_thoughts": 1,
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "partial_rotary_factor": 0.25,
  "rope_scaling": null,
  "rope_theta": 10000,
  "rotary_emb_base": 10000,
  "rotary_pct": 0.25,
  "scale_embeds": true,
  "softmax_temperature": 1.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.1",
  "use_all_logits": false,
  "use_cache": false,
  "use_parallel_residual": true,
  "random_jacobi_iterations": true,
  "vocab_size": 50304
}
